<template>
  <div :class="$style.main">
    <div :class="$style.box">
      <div :class="$style.dr_image">
        <img :class="$style.def_image" src="@/assets/imgs/drImage.jpg" />
      </div>
      <div :class="$style.name_doctor">
        <h1>دکتر فرشته زمانی</h1>
        <p>متخصص زیبایی و پوست</p>
      </div>
      <div :class="$style.text">
        من دکتر فرشته زمانی با بیش از 10 سال سابقه فعالیت در زمینه زیبایی و
        جوانسازی، همواره در حال آموختن بهترین شیوه ها و متدهای به روز دنیا می
        باشم و با شرکت در همایش های آموزشی سراسر دنیا، سعی در طراحی و اجرای
        بهترین و مناسب ترین روش جوانسازی به شکل فردی و تخصصی دارم. این اطمینان
        را به شما خواهم داد که با استفاده از بهترین برند های روز دنیا مثل ژل
        الانسه (با خاصیت کلاژن سازی) و همچنین سایر برندهای معتبر دنیا، تزریقی
        بسیار زیبا و متناسب با صورت و زیبایی طبیعی خودتان خواهید داشت.
      </div>
      <div :class="$style.flexfix">
        <div
          :class="$style.certificate_image"
          v-for="(item, id) in certificates"
          :key="id"
        >
          <img :class="$style.def_image" :src="item" />
        </div>
      </div>
      <div :class="$style.title">جواب تمام سوال های شما پیش ماست</div>
      <div :class="$style.dash_image">
        <img src="@/assets/imgs/4.png" />
      </div>
      <div :class="$style.listofqustion">
        <Qustion
          v-for="(item, id) in questions"
          :key="id"
          :question="item.quest"
          :answer="item.answer"
        />
      </div>
    </div>
  </div>
</template>

<script>
  import Qustion from './QustionBox.vue';
  export default {
    name: 'AboutMain',
    components: {
      Qustion
    },
    data: () => ({
      certificates: [
        require('@/assets/imgs/certificate.png'),
        require('@/assets/imgs/certificate.png'),
        require('@/assets/imgs/certificate.png'),
        require('@/assets/imgs/certificate.png')
      ],
      questions: [
        {
          quest: 'تفاوت بوتاکس و ژل در چیست؟ ',
          answer:
            ' بوتاکس برای برطرف کردن خط اخم و خطوط افقی پیشانی و خط های پنجه کلاغی بزرگ دور چشم استفاده میشه ، ولی ژل یک ماده پرکننده است که برای فرم دادن و حجم دادن به صورت و جبران چربی های از دست رفته صورت به کار گرفته میشه. '
        },
        {
          quest: 'فرق ژل الانسه با سایر ژل ها در چیست؟ ',
          answer:
            ' اکثر ژل هایی که در حال حاضر استفاده می شوند، از جنس هیالورنیک اسید می باشند. این ژل ها صرفا جهت حجم دهی مورد استفاده قرار می گیرند. در صورتیکه ژل الانسه، یک ژل جدید با فرمولی استثنایی جهت حجم دهی همراه با کلاژن سازی می باشد. از این رو باعث جوانسازی صورت نیز خواهد شد. '
        },
        {
          quest: 'ماندگاری بوتاکس چقدر است؟ ',
          answer:
            ' ماندگاری بوتاکس در بدن به عوامل مختلفی بستگی دارد و عموما بین 3 تا 6 ماه می باشد. از این رو، تزریق بوتاکس معمولا 2 بار در سال توصیه می شود. '
        },
        {
          quest: 'شما چه نوع بوتاکسی رو توصیه و استفاده می کنید؟ ',
          answer:
            ' ما در کلاب سلامتی و زیبایی دکتر زمانی از 2 نوع بوتاکس مصپورت (بوتاکس ایرانی) و دیسپورت(بوتاکس انگلیسی) استفاده می کنیم. هر دو نوع بوتاکس، دارای مجوز وزارت بهداشت می باشند و از این رو، بسیار با کیفیت و قابل اعتماد هستند. '
        },
        {
          quest: 'ماندگاری ژل چقدر است؟ ',
          answer:
            ' ژل های هیالورنیک اسید که شامل ژل های ژوویدرم و باقی ژل ها نیز می شوند، معمولا بین 8 تا 9 ماه و در بهترین حالت 2 سال ماندگاری دارند. اما ژل الانسه دارای ماندگاری بیشتر از 2 سال نیز می باشد. '
        },
        {
          quest: 'چربی بهتر است یا ژل؟ ',
          answer:
            ' انتخاب بین این دو مورد بستگی به بدن و صورت شما دارد. تزریق چربی جهت حجم دهی بیشتر استفاده می شود و هزینه کمتری نسبت به تزریق ژل دارد. اما در نظر داشته باشید که تزریق ژل کار بسیار ساده تری است که طی نیم ساعت قابل انجام است. بهترین راه برای انتخاب نهایی بین این دو، مشاوره و ویزیت پزشک است. '
        },
        {
          quest: 'برای رفع گودی و کبودی زیر چشم چه اقدامی می توان انجام داد؟ ',
          answer:
            ' معمولا منشاء گودی زیر چشم، از بین رفتن بافت چربی زیر پوست و یا عوامل ژنتیکی می باشد. راه حل قطعی جهت رفع آن تزریق ژل یا چربی است. توصیه اول من در این زمینه تزریق ژل می باشد. ژل های مورد استفاده در این مورد، ژل های نرم و مخصوص ناحیه دورچشم می باشند. این ژل ها، با تزریق درست و حرفه ای، زیر پوست جمع نخواهند شد و هیچ عارضه خاصی را ایجاد نمی کنند. '
        },
        {
          quest: 'سایر روش های جوانسازی بدون انجام تزریقات کدامند؟ ',
          answer:
            ' اگر بین سن 30 تا 40 سال سن دارید، توصیه اول ما انجام کارهایی مثل آراف فرکشنال و پلاژن تراپی است که در یک پکیج بسیار خوب قابل ارائه می باشد. ولی اگر بیشتر از 40 سال سن دارید و تمایل به انجام خدمات جوانسازی بدون تزریق دارید، اولین توصیه ما به شما، هایفو تراپی است. برای تصمیم گیری بهتر، بهترین راه کمک گرفتن از مشاوره خصوصی است. تا بر اساس نوع پوست، ویژگی های فردی و شخصی شما یک برنامه و پلن خاص برای شما طراحی شود. '
        },
        {
          quest: 'پروفایلو چیست؟ ',
          answer:
            ' یک ژل هیالورنیک اسید با فرمول خاصی هستش که غلظت بسیار بالایی داره ولی کار حجم دهی انجام نمی دهد، فرمول انحصاری ژل در کلاژن سازی و جوانسازی و لیفت بسیار عالی آن می باشد. این روش به افرادی توصیه می شود که بیشتر از حجم دهی، تمایل به جوانسازی و کلاژن سازی پوست دارند. '
        },
        {
          quest: 'درمان قطعی منافذ باز و جای جوش چیست؟ ',
          answer:
            ' برای درمان منافذ باز و جای جوش، راههای مختلفی پیشنهاد می شود مثل آراف فرکشنال، تیکسل، میکرونیدلینگ، مزونیدلینگ، پلاژن تراپی و غیره. بعد از انجام مشاوره تخصصی، بهترین روش متناسب با هر فرد انتخاب خواهد شد. '
        },
        {
          quest: 'ماندگاری ژل لب چه مدت است و آیا زیر پوست گوله خواهد شد؟ ',
          answer:
            ' ژل های هیالورنیک اسید مورد استفاده در تزریق لب، بین 9 ماه تا 1 سال ماندگاری دارند. در دفعات اول تزریق، این مدت ممکن است کوتاه تر باشد. به این دلیل که در دفعات اول استفاده، ماده ژل بیشتر اقدام به پر کردن جاهای خالی می کند و حجم دهی کمتری خواهد داشت. ولی با دفعات تزریق در فواصل نزدیک، به حجم دلخواه شما خواهد رسید. گوله شدن ژل، بستگی به تکنیک تزریق و نوع ماده و ژل مورد استفاده دارد. با انتخاب تکنیک تزریق درست و نوع ژل مرغوب، ژل لب به هیچ عنوان گوله نخواهد شد. '
        },
        {
          quest: 'پلاژن تراپی چیست؟ ',
          answer:
            ' از این دستگاه مدرن برای پاکسازی، آبرسانی و تغذیه پوست استفاده می شود. این دستگاه از طریق یک کپسول و 2 عدد ژل خاص، منجر به جوانسازی پوست و از بین بردن لک ها می شود. حین استفاده از روش پلاژن تراپی، حباب های ریز دی اکسید کربن ایجاده شده روی سطح پوست، منجر به تغذیه خواهند شد. همچنین عمل پاکسازی از طریق آن کپسول انجام می گیرد. در متد پلاژن تراپی از آراف و ماساژ هم استفاده می شود. از این رو این روش را می توان یکی از خدمات جوانسازی کامل برای پوست صورت دانست. '
        },
        {
          quest: 'فرق تیکسل و لیزر Co2فرکشنال چیست؟ ',
          answer:
            ' تیکسل، دستگاه جدید و محصول شرکت آلمان است. این دستگاه، فقط با مکانیزم گرمای زیاد (حدود 400 درجه) کار می کند و از انرژی لیزر در آن استفاده نشده است. در این روش، یک لایه از سطح پوست سوخته می شود. این متد کاملا مطمئن و ایمن هست، همچنین درد کمتر و دوره نقاهت بسیار کمتری نسبت به لیزر دارد. '
        }
      ]
    })
  };
</script>

<style lang="scss" module>
  .main {
    width: 100%;
    .box {
      margin: 0px 8px;
      float: right;
      background: #f9ebea;
      padding-bottom: 47px;
    }
    .name_doctor {
      float: left;
      margin: -135px 0px 0 53px;
      position: relative;
      h1 {
        color: #4f246e;
        font-size: 19px;
        font-weight: 600;
        word-spacing: -2px;
      }
      p {
        color: #040000;
        font-size: 13px;
        word-spacing: -1px;
      }
    }
    .text {
      font-size: 13px;
      line-height: 1.8;
      color: #040000;
      margin-bottom: 19px;
      margin-top: 10px;
      text-align: justify;
      padding: 7px 27px 0 27px;
    }
    .dr_image {
      position: relative;
      margin: 0px 18px 0 51px;
      &:before {
        content: '';
        display: block;
        padding-bottom: 60%;
      }
    }
    .def_image {
      overflow: hidden;
      position: absolute;
      left: 0;
      right: 0;
      top: 0;
      bottom: 0;
      width: 100%;
    }
    .certificate_image {
      position: relative;
      width: 45.9%;
      margin: 0 auto 8px auto;
      &:before {
        content: '';
        display: block;
        padding-bottom: 72.5%;
      }
    }
    .title {
      font-weight: bold;
      width: 100%;
      text-align: center;
      float: left;
      margin: 19px auto 0 auto;
    }
    .dash_image {
      float: left;
      margin: 8px 30.9% 7px;
      img {
        width: 100%;
        display: block;
      }
    }
    .flexfix {
      display: flex;
      flex-flow: row wrap;
    }
  }
</style>
